hw4/app/controllers/movies_controller.rb

  def related
    @movie = Movie.find(params[:id])
    if @movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]